[
    {
     "name": "ball",
      "shortDescription": "ping-pong ball",
      "longDescription": "It's a small white ping-pong ball, much like the ones they make on Earth.",
      "initialLocation": "van",
      "location": "van",
      "weight": 3,
      "pickupMessage": "For some reason you put the ping-pong ball in your mouth.",
      "dropMessage": "The ball bounces and rolls away before stopping."
    },
  {
    "name": "pencil",
    "shortDescription": "pencil",
    "longDescription": "This pencil is yellow, and sharpened. It's a #3 pencil, which makes it one better than your average pencil.",
    "initialLocation": "player",
    "location": "player",
    "weight": 1,
    "pickupMessage": "You grab the pencil and tuck it behind one ear like a science professor."
  },
  {
    "name": "gum",
    "shortDescription": "piece of gum",
    "longDescription": "The gum is a small wad of pink goo. It looks like it has already been chewed, but not by you.",
    "initialLocation": "player",
    "location": "player",
    "weight": 1
  },
  {
    "name": "library",
    "shortDescription": "javascript library",
    "longDescription": "The javascript library resembles a carved wooden box.",
    "initialLocation": "mushroom",
    "location": "mushroom",
    "weight": 100
  },
  {
    "name": "raft",
    "shortDescription": "small rubber raft",
    "longDescription": "The raft is made of rubber and full of air.",
    "pickupMessage": "You sling the raft over your shoulder and onto your back.",
    "initialLocation": "mushroom",
    "location": "mushroom",
    "weight": 10,
    "use": {
      "where": "river",
      "useMessage": "You throw the raft into the river and then hop in, paddling furiously with your hands. After a few frantic minutes, you reach the far side of the river and hop out of the raft.",
      "newLocation": "far side",
      "points": 10
    }
  },
  {
    "name": "glass",
    "shortDescription": "spooky glass",
    "longDescription": "The spooky glass is small, and oblong.",
    "pickupMessage": "You pick it up, with hesitation, because it's extra spooky.",
    "initialLocation": "treetop",
    "location": "treetop",
    "weight": 3,
    "use": {
      "where": "mushroom",
      "useMessage": "You hold the spooky glass up, and through it you can see that the cyrillic message on the wall says: Russian Warship, go fuck yourself!",
      "newLocation": "mushroom",
      "points": 10
    }
  },
  {
    "name": "marble",
    "shortDescription": "silver marble",
    "longDescription": "The marble is like a mirror, looking deep into your soul. It reminds you of a spinning disco ball.",
    "pickupMessage": "You pick it up, and it regards you with suspicion.",
    "initialLocation": "maze-l",
    "location": "maze-l",
    "weight": 1,
    "use": {
      "where": "van",
      "useMessage": "You hold the marble up and suddenly you hear keyboards in the distance. The Bee-Gees poster on the wall seems to suddenly come to life.",
      "newLocation": "bunker",
      "points": 10
    }
  },
  {
    "name": "barrel",
    "shortDescription": "wooden barrel",
    "longDescription": "The barrel looks sturdy and just big enough for an idiot to get into.",
    "pickupMessage": "You pick it up, and sling it over your back. It's heavy and you aren't sure how far you can carry it.",
    "initialLocation": "swamp",
    "location": "swamp",
    "weight": 40,
    "use": {
      "where": "waterfall",
      "useMessage": "You climb into the barrel, like an idiot, and roll into the river just above the waterfall. The strong current carries you over the falls.",
      "newLocation": "lagoon",
      "points": 10
    }
  },
  {
    "name": "dove",
    "shortDescription": "winter dove",
    "longDescription": "The dove reminds you of snow and birds.",
    "pickupMessage": "You gently pick up the dove, which doesn't try to fly away. In a tiny bird voice it says, Stephen King is my spirit animal.",
    "initialLocation": "lagoon",
    "location": "lagoon",
    "weight": 3,
    "use": {
      "where": "tower",
      "useMessage": "You release the dove and it spirals toward the sun, looking down at you one last time. A guitar appears at your feet.",
      "newLocation": "tower",
      "newItem": "guitar",
      "points": 10
    }
  },
  {
    "name": "guitar",
    "shortDescription": "purple electric guitar",
    "longDescription": "The guitar is purple and looks ancient and worn, but still functional.",
    "pickupMessage": "You pick up the guitar and strum an E Minor chord--as people do.",
    "initialLocation": "",
    "location": "",
    "weight": 5,
    "use": {
      "where": "clearing",
      "useMessage": "You start playing Stairway to Heaven. A Gnome shows up and slaps you.",
      "newLocation": "maze-l",
      "points": 10
    }
  },
  {
    "name": "key",
    "shortDescription": "gold key",
    "longDescription": "The key is ornate and made out of gold. It has a ruby jewel on the handle.",
    "pickupMessage": "You pick up the key",
    "initialLocation": "",
    "location": "maze-c",
    "weight": 1,
    "use": {
      "where": "doorway",
      "useMessage": "You put the key in the door lock and turn it. A box of sand drops out of the sky, but the door does not open.",
      "newItem": "sand",
      "points": 10
    }
  },
  {
    "name": "cable",
    "shortDescription": "HDMI cable",
    "longDescription": "The HDMI cable is black and three meters long.",
    "pickupMessage": "You pick up the cable and wrap it around your waist like a belt.",
    "initialLocation": "",
    "location": "",
    "weight": 1,
    "use": {
      "where": "bunker",
      "useMessage": "You plug one end of the cable into the trashcan, and the other end into the rectangular screen on the wall. There's a flicker and then the image resolves into a line of text that reads, GUESS MY WORD! IT'S 6 CHARACTERS LONG! FOR EACH LETTER YOU GET RIGHT, I WILL PRINT A 'C' UNLESS IT'S IN THE WRONG SPOT. THOSE WILL GET A 'W'. LETTERS THAT AREN'T EVEN IN MY WORD GET AN 'X'. You only have 6 guesses before you lose your marble.",
      "newLocation": "",
      "parser": "wordPuzzle",
      "points": 10
    }
  },
  {
    "name": "sand",
    "shortDescription": "box of sand",
    "longDescription": "The box of sand weighs a few pounds. On the side of the box it says 'Sand?'",
    "pickupMessage": "You pick up sand, which is in a box.",
    "initialLocation": "",
    "location": "",
    "weight": 1,
    "use": {
      "where": "node farm",
      "useMessage": "You pour the sand into the node farm and the nodes begin singing a happy song. A flare gun appears in mid-air and then lands softly at your feet.",
      "newLocation": "node farm",
      "newItem": "gun",
      "points": 10
    }
  },
  {
    "name": "gun",
    "shortDescription": "flare gun",
    "longDescription": "The flare gun is metallic, with one barrel and one trigger. It looks like a flare is loaded into the chamber.",
    "pickupMessage": "You pick up flare gun and make sure the safety is flipped on, then you tuck it into your left front pocket where it's likely to shoot off your wang--if you have a wang. If not... congratulations!",
    "initialLocation": "",
    "location": "",
    "weight": 1,
    "use": {
      "where": "clearing",
      "useMessage": "You fire the flare gun into the air. The helicopter stops circling and gets closer. Just as you think it's going to land, the pilot throws a black cable out of the window and then heads back skyward.",
      "newLocation": "clearing",
      "newItem": "cable",
      "points": 10
    }
  },
  {
    "name": "snake",
    "shortDescription": "poisonous snake",
    "longDescription": "The snake is a Nazi, which you can tell from the look in it's eyes--and the red MAGA hat.",
    "pickupMessage": "Why would you do that? It bites you on the arm and you drop it.",
    "initialLocation": "swamp",
    "location": "swamp",
    "weight": 1,
    "damage": 10
  },
  {
    "name": "booster",
    "shortDescription": "booster",
    "longDescription": "The booster looks like a chocolate donut, but you know it must have an embedded tracking device.",
    "pickupMessage": "You shove the whole thing in your mouth at once, like an animal. Your skin tingles and the back of your neck goes cold.",
    "initialLocation": "clearing",
    "location": "clearing",
    "weight": 1,
    "damage": -10
  },
  {
    "name": "bucket",
    "shortDescription": "bucket",
    "longDescription": "The bucket is full of acid and smells like a bad idea.",
    "pickupMessage": "You are a little clumsy and the acid spills all over your face. You drop the bucket and scream a little.",
    "initialLocation": "lagoon",
    "location": "lagoon",
    "weight": 1,
    "damage": 30
  }
]
